trash-hold/STM32_modular_robot/source/NUCLEO-F446RE_prototypes/Core/Inc/ADXL345.h
#ifndef INC_ADXL345_H_
#define INC_ADXL345_H_

#include "stm32f4xx_hal.h"
#include "error_codes.h"

#define ACC0_LINE 0x00
#define ACC1_LINE 0x01

#define ACC_I2C_TIMEOUT 100
#define ACC_ALT_ADDRESS 0xA6

#define ACC_X0_REG 0x32
#define ACC_PWR_CTRL_REG 0x2D
#define ACC_DATA_FORMAT_REG 0x31
#define ACC_BW_RATE_REG 0x2C
#define ACC_FIFO_CTL_REG 0x38
#define ACC_INT_ENB_REG 0x2E

extern I2C_HandleTypeDef *acc0_i2c;
extern I2C_HandleTypeDef *acc1_i2c;

ReturnCode Acc_AddController(I2C_HandleTypeDef* handler, uint32_t pin, uint32_t port, uint8_t line);
ReturnCode Acc_RawMeasurment(int16_t* xyz_buffer, uint8_t line);
ReturnCode Acc_AvgMeasurment(int16_t *xyz_buffer, uint32_t samples, uint8_t line);
ReturnCode Acc_SelfTest(int16_t* result_buffer, uint8_t line);
ReturnCode Acc_Config(uint8_t line);

#endif /* INC_ADXL345_H_ */
